Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memn.tmx
Source language: ca
Languages: es_es

source: Estratègia de solució: si detectem ``.'' [blanc] [minúscula], no segmentem; si detectem ``.'' [blanc] [número], no segmentem; si detectem ``.'' [blanc] [majúscula], què fem?: depén de l'abreviatura (la decisió és impracticable sense vocabularis de noms propis).
es_es: Estrategia de solución: si detectamos ``.'' [blanco] [minúscula], no segmentamos; si detectamos ``.'' [blanco] [número], no segmentamos; si detectamos ``.'' [blanco] [mayúscula], qué hagamos?: depende de la abreviatura (la decisión es impracticable sin vocabularios de nombres propios).

source: D'altra banda, l'organització, el manteniment i la explotació de grans memòries de traducció distribuïdes (en les diverses màquines d'una xarxa) està lluny de ser trivial.
es_es: Por otro lado, la organización, el mantenimiento y la explotación de grandes memorias de traducción distribuidas (en las diversas máquinas de una red) está lejos de ser trivial.

source: D'una banda, es poden produir incoherències terminològiques i d'estil entre els fragments procedents de grups diferents; les decisions en cas de conflicte comporten mecanismes complexos de reconeixement d'autoritat o de prestigi, que poden ser difícils de consensuar.
es_es: Por un lado, se pueden producir incoherencias terminológicas y de estilo entre los fragmentos procedentes de grupos diferentes; las decisiones en caso de conflicto comportan mecanismos complejos de reconocimiento de autoridad o de prestigio, que pueden ser difíciles de consensuar.

source: i per UGT [...] [...] per al Sr. Martínez [...] En els dos primers casos el punt és el final de l'oració però en els dos últims no.
es_es: y por UGT [...] [...] para el Sr. Martínez [...] En los dos primeros casos el punto es el final de la oración pero en los dos últimos no.

source: Memòries de traducció
es_es: Memorias de traducción

source: Cal definir clarament les regles de segmentació; els programes de memòria de traducció solen permetre que la persona usuària modifique o refine aquestes regles.
es_es: Hay que definir claramente las reglas de segmentación; los programas de memoria de traducción suelen permitir que la persona usuaria modifique o refine estas reglas.

source: Molts dels problemes que apareixen quan es tracten textos amb l'ordinador provenen de discrepàncies quant a la manera de fer-ho.
es_es: Muchos de los problemas que aparecen cuando se tratan textos con el ordenador provienen de discrepancias en cuanto a la manera de hacerlo.

source: {}usant la informació sintàctica com a pista.
es_es: {}usando la información sintáctica como pista.

source: La grandària ideal és, per tant, un compromís entre la cobertura dels fragments menuts i la precisió dels fragments més grans.
es_es: El tamaño ideal es, por lo tanto, un compromiso entre la cobertura de los fragmentos pequeños y la precisión de los fragmentos más grandes.

source: Però els bitextos complets no es poden aprofitar tal com estan perquè és molt improbable que ens encarreguen de nou exactament la mateixa tasca de traducció, és a dir, que ens encarreguen traduir de nou un text $E'$ quan tenim ja el bitext $(E',D')$, però el que sí que és probable és que algunes parts del text nou $E'$ apareguen també en la part esquerra d'alguns dels bitextos que ja tenim.
es_es: Pero los bitextos completos no se pueden aprovechar tal como están porque es muy improbable que nos encargen de nuevo exactamente la misma tarea de traducción, es decir, que nos encargen traducir de nuevo un texto $I'$ cuando tenemos ya el *bitext $(I',D')$, pero el que sí que es probable es que algunas partes del texto nuevo $I'$ aparezcan también en la parte izquierda de algunos de los bitextos que ya tenemos.

source: (c) (c) (b) (a) (c) (a) El punt apareix en moltes construccions que no indiquen el final de una oració.
es_es: (c) (c) (b) (a) (c) (a) El punto aparece en muchas construcciones que no indican el final de una oración.

source: Introducció
es_es: Introducción

source: Els codis ASCII del 0 al 31 no corresponen a caràcters imprimibles sinó a caràcters de control que tenen noms especials i s'usen per a un control rudimentari del format i de la transmissió dels textos.
es_es: Los códigos ASCII del 0 al 31 no corresponden a caracteres imprimibles sino a caracteres de control<\/y0> que tienen nombres especiales y se usan para un control rudimentario del formato y de la transmisión de los textos.

source: Però quin és l'alineament òptim d'un bitext?
es_es: ¿Pero cual es el alineamiento óptimo de un bitext?

source: Els resultats produïts per una memòria de traducció no necessiten revisió, ja que es basen en traduccions correctes realizades anteriorment per professionals.
es_es: Los resultados producidos por una memoria de traducción no necesitan revisión, puesto que se basan en traducciones correctas realizades anteriormente por profesionales.

source: Les memòries de traducció usen els signes de puntuació per a segmentar les oracions abans d'alinear els textos.
es_es: Las memorias de traducción usan los signos de puntuación para segmentar las oraciones antes de alinear los textos.

source: Quant al funcionament, a quins sistemes de traducció automàtica s'assemblen més les memòries de traducció?
es_es: En cuanto al funcionamiento, a qué sistemas de traducción automática se asemejan más las memorias de traducción?

source: Així és més probable que quan ens donen un text nou $E'$ tinguem traduccions per a alguns dels seus fragments.
es_es: Así es más probable que cuando nos dan un texto nuevo $I'$ tengamos traducciones para algunos de sus fragmentos.

source: Per això, és necessària l'assignació de codis (que també es convertiran en octets) per a regular altres característiques del text: l'aparença visual o de presentació (per exemple, ``inici cursives'', ``final negretes'', ``lletra de 16 punts''), o l'estructura (és a dir, l'organització del contingut, per exemple, ``títol de secció'', ``llista numerada'', ``nota a peu de pàgina'', ``fila d'una taula'', etc.)
es_es: Por eso, es necesaria la asignación de códigos<\/y0> (que también se convertirán en octetos) para regular otras características del texto: la apariencia visual<\/y1> o de presentación (por ejemplo, ``inicio cursivas'', ``final negritas'', ``letra de 16 puntos''), o la estructura<\/y2> (es decir, la organización del contenido, por ejemplo, ``título de sección'', ``lista numerada'', ``nota a pie de página'', ``fila de una tabla'', etc.)

source: Per exemple, si a la memòria hi ha la UT {"{}Connecteu l'ordinador a la impressora."}{"{}Conecte el ordenador a la impresora"} però el nou text conté la frase "{Connecteu l'ordinador a la xarxa"}, el programa pot trobar les correspondències {"{}impressora"}{"{}impresora"} {"xarxa"}{"red"} en una base de dades lèxica i usar-les per a proposar la traducció correcta ("{Conecte el ordenador a la red}).
es_es: Por ejemplo, si en la memoria esta la UT {"{}Connecteu l'ordinador a la impressora."}{"{}Conecte el ordenador a la impresora"}pero el texto nuevo contiene la frase "{Connecteu l'ordinador a la xarxa"}, el programa puede encontrarse con las equivalencias {"{}impressora"}{"{}impresora"} {"xarxa"}{"red"} en una base de datos léxica y usarlas para proponer la traducción correcta("{Conecte el ordenador a la red}).

source: Segmentar els dos textos i alinear-los.
es_es: Segmentar los dos textos y alinearlos.

source: L'objectiu és, per tant, aprofitar traduccions anteriors per a no repetir l'esforç quan s'han de fer traduccions noves.
es_es: El objetivo es, por lo tanto, aprovechar traducciones anteriores para no repetir el esfuerzo cuando se tienen que hacer traducciones nuevas.

source: Indica quina d'aquestes afirmacions és falsa.
es_es: Indica cual de estas afirmaciones es falsa.

source: Punts al final de sigles: CC.OO(.), O.N.U(.).
es_es: Puntos al final de siglas: CC.OO(.), O.N.Uno(.).

source: Una vegada feta la pretraducció del text esquerre $E'$ a la llengua dreta, el programa la mostra alineada amb el text esquerre perquè la persona usuària la puga corregir i produir el text dret correcte $D'$.
es_es: Una vez hecha la *pretraducció del texto izquierdo $I'$ a la lengua derecha, el programa la muestra alineada con el texto izquierdo porque la persona usuaria la pueda corregir y producir el texto derecho correcto $D'$.

source: En cas de trobar fragments idèntics per als quals només hi haja una traducció disponible, només cal inserir-ne la traducció directament.
es_es: En caso de encontrar fragmentos idénticos para los cuals sólo haya una traducción disponible, sólo hay que insertar la traducción directamente.

source: Un text informatitzat és, com qualsevol porció de dades informatitzada, una seqüència de bits, és a dir, d'uns i zeros de l'estil de la següent:
es_es: Un texto informatizado<\/y0> es, como cualquier segmento de datos informatizados, una secuencia de bits<\/y1>, es decir, de unos<\/y2> y ceros<\/y3> del estilo:

source: Els programes més recents resolen això amb filtres o conversors per als formats de text més freqüents, filtres que fan invisibles a la persona usuària les característiques de format dels documents perquè puguen concentrar-se en les textuals.
es_es: Los programas más recientes resuelven esto con filtros o *conversors para los formatos de texto más frecuentes, filtros que hacen invisibles a la persona usuaria las características de formato de los documentos porque puedan concentrarse en las textuales.

source: El pot haver generat un sistema de reconeixement de la parla (vegeu la secció ) a partir de la veu de la persona que l'ha dictat.
es_es: Lo puede haber generado un sistema de reconocimiento del habla<\/y2> (ver sección ) a partir de la voz de la persona que lo ha dictado.

source: Una vegada alineats els bitextos les unitats de traducció s'organitzen en una base de dades perquè tant el programa com la persona usuària hi puguen accedir eficientment.
es_es: Una vez alineados los bitextos las unidades de traducción se organizan en una base de datos porque tanto el programa como la persona usuaria puedan acceder eficientemente.

source: o d'altres que precedeixen noms propis (Avda., Pça.) o números (Tel.).
es_es: u otros que preceden nombres propios (Avda., Pça.) o números (Tel.).

source: {} en mots i petites unitats multimot (entre dos i quatre mots) de gran repetitivitat.
es_es: {} en palabras y pequeñas unidades multi-palabra (entre dos y cuatro palabras) de gran respectividad.

source: La taula mostra alguns exemples de codis ASCII.
es_es: La tabla muestra algunos ejemplos de códigos ASCII.

source: Les noves unitats de traducció $(e',d')$ que s'hagen produït en el procés es poden enviar a la memòria de traducció.
es_es: Las nuevas unidades de traducción $(i',d')$ que se hayan producido en el proceso se pueden enviar a la memoria de traducción.

source: Solució: no segmentar mai ``...'' si es troba.
es_es: Solución: no segmentar nunca ``...'' si se encuentra.

source: El fet que els textos estiguen escrits amb un lèxic monosèmic, és a dir, precís i no gens ambigu.
es_es: El hecho que los textos estén escritos con un léxico monosémico, es decir, preciso y no nada ambiguo.

source: Els documents de text, a més de caràcters i paraules, contenen informació de format que cal considerar en el procés de segmentació i alineament.
es_es: Los documentos de texto, además de caracteres y palabras, contienen información de formato que hay que considerar en el proceso de segmentación y alineamiento.

source: Això pot ser, d'una banda, perquè els professionals tenen així la impressió que el programa no tradueix sinó que organitza i fa més eficient el treball de traducció humana i, d'altra banda, perquè les memòries de traducció conserven l'estil i les decisions terminològiques de traduccions anteriors, que poden variar d'un equip a altre, mentres que els sistemes de traducció automàtica solen basar-se en seleccions terminològiques i d'estil de propòsit general, encara que siga dins d'una temàtica concreta.
es_es: Esto puede ser, por un lado, porque los profesionales tienen así la impresión que el programa no traduce sino que organiza y hace más eficiente el trabajo de traducción humana y, por otro lado, porque las memorias de traducción conservan el estilo y las decisiones terminológicas de traducciones anteriores, que pueden variar de un equipo a otro, mientras que los sistemas de traducción automática suelen basarse en selecciones terminológicas y de estilo de propósito general, aunque sea dentro de una temática concreta.

source: També hi ha una alternativa interessant de codi obert i distribució gratuïta, anomenada OmegaT}.
es_es: También hay una alternativa interesante de código abierto y distribución gratuita, llamada OmegaT}.

source: Suposarem que, com a resultat del treball anterior de traducció, tenim parells de textos $(E,D)$ on $E$ és el text esquerre (en la llengua esquerra) i $D$ és el text dret (en la llengua dreta), i volem traduir de la llengua esquerra a la llengua dreta.
es_es: Supondremos que, como resultado del trabajo anterior de traducción, tenemos pares de textos $(I,D)$ donde $I$ es el texto de la izquierda (en la lengua de la izquierda) y $D$ es el texto de la derecha (en la lengua de la derecha), y queremos traducir de la lengua izquierda a la lengua derecha.

source: Una aproximació a la traducció humana assistida per ordinador (és a dir, semiautomàtica) que està molt relacionada amb la traducció directa és la que s'usa en les anomenades memòries de traducció. La noció bàsica {somers96b,samuelson-brown96b} és la utilitat de tenir a mà, quan s'està traduint un text nou, exemples de frases similars i de les traduccions corresponents, provinents de traduccions realitzades anteriorment.
es_es: Una aproximación a la traducción humana asistida por ordenador (es decir, semiautomática) que está muy relacionada con la traducción directa es la que se usa en las llamadas memorias de traducción. La noción básica {*somers96b,*samuelson-*brown96b} es la utilidad de tener a mano, cuando se está traduciendo un texto nuevo, ejemplos de frases similares y de las traducciones correspondientes, provenientes de traducciones realizadas anteriormente.

source: Per exemple, el fragment espanyol las decepciones es pot correspondre en català amb les decebis o les decepcions però el fragment las decepciones sufridas només pot aparéixer alineat amb les decepcions patides.
es_es: Por ejemplo, el fragmento español las decepciones se puede corresponder en catalán con les decepcions o las decepciones pero el fragmento las decepciones sufridas sólo puede aparecer alineado con les decepcions patides.

source: Els d'UGT no van [...] [...] per CC.OO.
es_es: Los de UGT no [...] [...] por CC.OO.

source: {Existing translations contain more solutions to more translation problems than any other existing resource} -- Pierre Isabelle
es_es: {Existing translations contain more solutions to more translation problems than any other existing resource} -- Pierre Isabell

source: Molts programes marquen els fragments amb un codi que indica la temàtica o la naturalesa del document del qual s'ha extret el fragment, de manera que la temàtica del nou document servisca per a localitzar el fragment més adequat en cada cas.
es_es: Muchos programas marcan los fragmentos con un código que indica la temática o la naturaleza del documento del cual se ha extraído el fragmento, de forma que la temática del nuevo documento sirva para localizar el fragmento más adecuado en cada caso.

source: Solució: la millor seria una regla general (patró o expressió regular) que detectara aquestes entitats i evitara segmentar-les.
es_es: Solución: la mejor sería una regla general (patrón o expresión regular) que detectara estas entidades y evitara segmentarlas.

source: D'altra banda, si els fragments són massa llargs és molt menys probable que es repetisquen exactament en textos futurs, però és més improbable que siguen ambigus. El fragment ideal seria el que és suficientment menut per a aparéixer sovint però suficientment complet com per a tenir una traducció constant.
es_es: Por otro lado, si los fragmentos son demasiado largos es mucho menos probable que se repitan exactamente en textos futuros, pero es más improbable que sean ambiguos. Lo fragmento ideal sería el que es suficientemente pequeño para aparecer a menudo pero suficientemente completo como para tener una traducción constante.

source: Direm que un bitext $(E,D)$ està alineat si hem dividit $E$ i $D$ en $N$ segments, $E= e_1 e_2 e_3 e_N$ i $D= d_1 d_2 d_3 d_N$, de manera que tenim $N$ bitextos $(e_1,d_1)$, $(e_2,d_2)$, $(e_3,d_3)$, etc., més menuts (per això els escrivim amb minúscula); aquests bitextos s'anomenen normalment unitats de traducció (UT).
es_es: Diremos que un bitexto $(I,D)$ está alineado si hemos dividido $I$ y $D$ en $N$ segmentos, $I= i_1 i_2 i_3 i_N$ y $D= d_1 d_2 d_3 d_N$, de forma que tenemos $N$ bitextos $(i_1,d_1)$, $(i_2,d_2)$, $(i_3,d_3)$, etc., más pequeños (por eso los escribimos con minúscula); estos bitextos se denominan normalmente unidades de traducción (UT).

source: Per a traduir un text nou amb una memòria de traducció és necessari que hi haja textos originals i traduïts que hagen estat alineats.
es_es: Para traducir un texto nuevo con una memoria de traducción es necesario que haya textos originales y traducidos que hayan sido alineados.

source: La codificació és l'assignació d'una seqüència concreta, d'un o més octets, a cada caràcter possible d'un text.
es_es: La codificación<\/y0> es la asignación de una secuencia concreta, de uno o más octetos<\/y1>, a cada posible carácter de un texto.

source: Possibles escapatòries: si detectem [minúscula] ``.'' [minúscula] (sense blancs), no segmentem.
es_es: Posibles escapatorias: si detectamos [minúscula] ``.'' [minúscula] (sin blancos), no segmentamos.

source: Vegeu aquest exemple on la llengua esquerra és el català i la llengua dreta, l'espanyol: $E$: ``Tenim textos equivalents i els volem aprofitar per a fer noves traduccions.
es_es: Contemplad este ejemplo donde la lengua izquierda es el catalán y la lengua derecha, el español: $I$: ``Tenim textos equivalents i els volem aprofitar per a fer noves traduccions.

source: $$ {Esquema del procés de pretraducció d'un nou text esquerre usant una memòria de traducció.}
es_es: $$ {Esquema del proceso de pretraducción de un nuevo texto de la izquierda usando una memoria de traducción.}

source: A més, moltes vegades el treball de traducció comporta un esforç creatiu considerable, com ara quan es tracta de trobar una equivalència adequada a alguna expressió especialment difícil de traduir; les memòries de traducció permetrien no haver de repetir aquest esforç en el futur.
es_es: Además, muchas veces el trabajo de traducción comporta un esfuerzo creativo considerable, como por ejemplo cuando se trata de encontrar una equivalencia adecuada en alguna expresión especialmente difícil de traducir; las memorias de traducción permitirían no tener que repetir este esfuerzo en el futuro.

source: Una memòria de traducció és un sistema de traducció directa amb equivalències entre fragments de text extretes de textos anteriorment traduïts.
es_es: Una memoria de traducción es un sistema de traducción directa con equivalencias entre fragmentos de texto extraídas de textos anteriormente traducidos.

source: Heus ací uns exemples i com detectar-los per a no segmentar.
es_es: He aquí unos ejemplos y como detectarlos para no segmentar.

source: Però, fins i tot quan ja s'ha resolt aquest problema tècnic, l'intercanvi de memòries de traducció entre traductors o equips de traducció diferents no està exempt de problemes.
es_es: Pero, incluso cuando ya se ha resuelto este problema técnico, el intercambio de memorias de traducción entre traductores o equipos de traducción diferentes no está exento de problemas.

source: Els professionals valoren molt la capacitat de gestionar el format de manera senzilla i eficient, ja que la preservació del format de les traduccions és una de les tasques que els fa perdre més temps.
es_es: Los profesionales valoran mucho la capacidad de gestionar el formato de manera sencilla y eficiente, puesto que la preservación del formato de las traducciones es una de las tareas que los hace perder más tiempo.

source: Punts de milers (1.259), milions (1.032.200), decimals saxons (3.4), números de telèfon francesos (01.10.23.87.49), dates (20.01.1999), etc.
es_es: Puntos de miles (1.259), millones (1.032.200), decimales saxons (3.4), números de teléfono franceses (01.10.23.87.49), fechas (20.01.1999), etc.

source: S'ha de tenir en compte que la utilitat de les memòries de traducció millora considerablement amb la grandària del corpus de traduccions usades per a omplir-les; per tant, no és estrany que una memòria de traducció haja de gestionar una gran quantitat de fragments.
es_es: Se tiene que tener en cuenta que la utilidad de las memorias de traducción mejora considerablemente con el tamaño del corpus de traducciones usadas para llenarlas; por lo tanto, no es extraño que una memoria de traducción tenga que gestionar una gran cantidad de fragmentos.

source: Hi ha, a més, tecnologies de traducció automàtica directa que s'assemblen molt al funcionament de les memòries de traducció; per exemple, l'edició bilingüe (espanyol--català) d'El Periódico de Catalunya (vegeu l'epígraf ) es prepara diàriament amb un mètode completament automàtic que funciona en molts aspectes de manera similar a una memòria de traducció.
es_es: Hay, además, tecnologías de traducción automática directa que se asemejan mucho al funcionamiento de las memorias de traducción; por ejemplo, la edición bilingüe (español--catalán) de El Periódico de Cataluña (ver el epígrafe ) se prepara diariamente con un método completamente automático que funciona en muchos aspectos de manera similar a una memoria de traducción.

source: {}usant regles que analitzen la puntuació i el format.
es_es: {}usando reglas que analizan la puntuación y el formato.

source: Codificació
es_es: Codificación

source: Les memòries de traducció comercials actuals alineen els textos {} {}fent un balanç òptim entre cobertura i precisió.
es_es: Las memorias de traducción comerciales actuales alinean los textos {} {}haciendo un balance óptimo entre cobertura y precisión.

source: El pot haver generat un sistema de reconeixement de textos escrits a partir d'un text tipografiat o manuscrit (vegeu la secció ).
es_es: Lo puede haber generado un sistema de reconocimiento de textos escritos<\/y3> a partir de un texto tipográfico o manuscrito (ver sección ).

source: Que hem de fer amb els bitextos existents per a poder reutilitzar la informació que contenen per a fer noves traduccions amb una memòria de traducció?
es_es: Que tenemos que hacer con los bitextos existentes para poder reutilizar la información que contienen para hacer nuevas traducciones con una memoria de traducción?

source: {{1.6cm{alineador- corrector assistit}}} {1cm{UTs $(e,d)$}} {{1.4cm{Memòria de traducció}}} $$ {Esquema del procés d'alineament d'un bitext existent per a alimentar una memòria de traducció.}
es_es: {{1.6cm{alineador-corrector asistido}}} {1cm{UTs $(e,d)$}} {{1.4cm{Memoria de traducción}}} $$ {Esquema del proceso de alineamiento de un bitexto existente para alimentar una memoria de traducción.}

source: Quan no?
es_es: Cuando no?

source: L'URI és {http://www.lisa.org/tmx/
es_es: El URI es {http://www.lisa.org/tmx/
